_posts/2023-12-17-what-is-a-computer.html
---
layout: post.liquid
title:  "What is a computer?"
date: 2023-12-17 Mo 19:36
last_updated: 2023-12-17 Mo 19:36
tags:
  - journal
  - computer
  - definition
categories: [journal, computer]
permalink: /2023-12-17-what-is-a-computer
toc: true
---


<p>
Computers are everywhere but what are they?
</p>


<div id="outline-container-org6996251" class="outline-2">
<h2 id="org6996251">Programmability is optional</h2>
<div class="outline-text-2" id="text-org6996251">
<p>
Talking with an Robotics teacher &#x2013; teaches the basics about Robots to
kids &#x2013; I asked: are Robots computers? The answer was a clear and
confident, yes! The dialog then went on roughly as follows:
</p>


<ul class="org-ul">
<li>P: if you have a Robot with a fixed program, is that still a
computer?</li>
<li>T: yes</li>
<li>P: a computer is typically an electronic circuit that can run some
sort of program. A calculator is an electronic gadget with a fixed
program, one that can evaluate arithmetic expressions. Is a
calculator a computer?</li>
<li>T: hmmm&#x2026; I guess it is</li>
</ul>


<p>
So programmability seems to be an optional feature of computers.
</p>
</div>
</div>



<div id="outline-container-org32961fd" class="outline-2">
<h2 id="org32961fd">Electronics are optional</h2>
<div class="outline-text-2" id="text-org32961fd">
<p>
I was taught that an algorithm is anything that takes inputs,
processes them in some way and then produces an output.  The
computer is the thing that executes/runs the algorithm and a
computer can be realized with non-electronic components.
</p>

<p>
Before electronics became the main way to realize computers, there
were other methods of manufacturing them. For a while humans were
called computers and were in charge of solving tons of math
problems which in some cases needed not a lot of deep thought or
problem solving skills, but simply having the ability to follow a
set of predefined instructions mechanically.
</p>

<p>
The description of the <a href="https://en.wikipedia.org/wiki/Turing_machine">Turing Machine</a> captures the essence of a
computer, a computer program and computation, all that with just
pen and paper, no need for fancy electronics.
</p>
</div>
</div>


<div id="outline-container-orgd352db5" class="outline-2">
<h2 id="orgd352db5">What is a computer program?</h2>
<div class="outline-text-2" id="text-orgd352db5">
<p>
In modern computers, a program is usually a text file written in
using a special syntax stored somewhere in a disk. The program can
be read any time by the computer and its instructions followed
blindly.
</p>

<p>
A program is composed of a sequence of basic instructions plus
a few special ones that control the flow of the program. You
could say that programming is nothing more than telling a computer
how to:
</p>

<ol class="org-ol">
<li>perform a series of dumb tasks,</li>
<li>decide which instruction to execute next, and</li>
<li>execute a series of steps repeatedly. <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></li>
</ol>


<p>
The computer program does not need to make use of all those
possibilities, a simple program that outputs a fixed string of text
once and then terminates is a perfectly respectable program.
</p>
</div>
</div>


<div id="outline-container-orgd0e712a" class="outline-2">
<h2 id="orgd0e712a">Where is the program?</h2>
<div class="outline-text-2" id="text-orgd0e712a">
<p>
Can programs be encoded in other ways? Think about a pair of
sunglasses, the glass is manufactured so that certain types of
light are filtered out; in some sense, filtering some light rays is
a decision about what to let through. As light rays come through
the glass the rules (program) encoded in the structure of the glass
continuously decide which rays should be filtered out. Does that
mean that sunglasses computers with a fixed program?
</p>

<p>
What about other objects? A glass is built (programmed) so that it
can contain liquids. The program is again encoded in the structure
of the glass. This &#x2013; perhaps flawed &#x2013; thinking can be applied to
pretty much any manufactured object and even to those that acquire
a function that was not originally intended.
</p>

<p>
If you agree that such objects are all computers in some sense, you
might also agree that a computer program can be encoded in the
structure of physical objects. Isn't this what we do when we build
electronic circuits, we design and build them so that they behave
the way we want.
</p>
</div>
</div>


<div id="outline-container-orgebc4a06" class="outline-2">
<h2 id="orgebc4a06">Is everything a computer?</h2>
<div class="outline-text-2" id="text-orgebc4a06">
<p>
Maybe, I don't know. You decide. I think that Thomas Kuhn would say
that a Computer is <a href="https://en.wikipedia.org/wiki/Paradigm">a paradigm</a>.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/Structured_program_theorem">Structured Program Theorem</a>
</p></div></div>


</div>
</div>